# Легенда-предисловие
label legend_prologue:
    
    play music "legend.mp3"
    # Изображение 1: Старые дома в сумерках
    # Описание: Темные силуэты старых домов, туманные улицы, мерцающие фонари
    scene bg l_black_town with dissolve
    "В тени старых домов, где время стерло границы между реальностью и мифами, скрывается тайна, о которой шепчутся ветра."
    
    # Изображение 2: Древний орден
    # Описание: Тени фигур в капюшонах, собирающихся вокруг стола с картами
    scene bg l_orden_on_table with dissolve
    "Говорят, что когда-то здесь правил древний орден,члены которого владели силой, способной менять судьбы."
    
    # Изображение 3: Магические карты
    scene bg l_people_and_cards with dissolve
    "Их оружием были не мечи, а карты — магические артефакты, вобравшие в себя души тех, кто осмеливался играть в их игру."
    
    # Изображение 4: Карты с ролями
    # Описание: Разложенные карты с символами мафии, доктора, стукача и любовницы
    scene bg l_cards_and_roles with dissolve
    "Каждая карта — это не просто роль, а клятва."
    "Мафия — власть тьмы,\nДоктор — надежда света,\nСтукач — тень сомнений,\nЛюбовница — яд страсти."
    
    # Изображение 5: Заброшенный дом
    # Описание: Темный, заброшенный дом с разбитыми окнами
    scene bg l_old_house with dissolve
    "Те, кто брал их в руки, навсегда попадали в ловушку ритуала."
    "Игра начиналась сама, а правила диктовали не люди, а древние силы, жаждущие крови и расплаты."
    
    # Изображение 6: Современный город
    # Описание: Современный город, пустые улицы на закате
    scene bg l_empty_city with dissolve
    "Столетия спустя пару парней находит в заброшенном доме пыльный ящик с этими картами."
    
    # Изображение 7: Карты в руках
    # Описание: Руки, держащие карты, с мерцающими символами
    scene bg l_cards_in_hands with dissolve
    "Они смеются, раздают роли, не зная, что уже связали себя невидимыми нитями с прошлым."
    
    # Изображение 8: Пустые улицы
    # Описание: Пустые улицы на закате, с туманными фигурами вдалеке
    scene bg l_empty_streets_dusk with dissolve
    "Но когда заходит солнце, город пустеет..."
    "а в воздухе висит шепот:"
    "<Из игры не выйти. Победит только один...>"
    "А так ли это?"
    
    # Изображение 9: Финальная сцена
    # Описание: Темная сцена с парящими картами и туманными фигурами
    scene bg l_final_scene with dissolve
    "Теперь им предстоит не просто сыграть в мафию."
    "Им придется стать ею."
    
    # Изображение 10: Заключительная сцена
    # Описание: Карты, разбросанные на земле, с тенью над ними
    scene bg l_final_cards with dissolve
    "Каждый выбор — шаг к спасению или гибели."
    "Каждое слово — клятва или предательство."
    "А карты… Они помнят всё."
    
    scene black with dissolve
    
    jump ep0_ep1
